
{
    "queries": [
        {
            "id": 1,
            "question": "Return the customer name and address as one field called fullAddress that consists of the address, city, state. Only show customers in 'IA' or 'BC' that have a valid address. Order by customer name ascending.",
            "query_string":"",
            "type": "medium"
        },
        {
            "id": 2,
            "question": "Return the shipment id, shipment date, product id, and amount for all shipments in 2022 where there was a product shipped with an amount greater than 8. Only show a shipment once and order by shipment date descending and amount descending.",
            "query_string": "",
            "type": "medium"
        },
        {
            "id": 3,
            "question": "Find all customers that have an 'R' or 'T' in their name and have a state of 'MI' or 'IA'. Order by customer name descending.",
            "query_string": "",
            "type": "simple"
        },
        {
            "id": 4,
            "question": "Return a list of the unique product id and names that have shipped before with an amount less than 5 and order by product id descending.",
            "query_string": "",
            "type": "simple"
        },
        {
            "id": 5,
            "question": "For each state, return the number of customers in that state and the number of shipments for customers in that state. Only show states with at least 2 shipments. Order by number of shipments descending.",
            "query_string": "",
            "type": "medium"
        },
        {
            "id": 6,
            "question": "Return the top 3 products for state 'AB' based on shipment revenue (amount*price) for the year 2022.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 7,
            "question": "Return a list of products (id and name) along with the number of times it has been shipped, the total amount of all shipments, and the total value of all shipments. Only consider shipments after September 1st, 2021, and only show products if they have been shipped at least three times and have a totalValueShipped > $110. Order by totalAmountShipped ascending.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 8,
            "question": "Return pairs of customers (only show a pair once) that have been shipped the same product. Return the number of times the pair of customers have been shipped the same product (numShippedProducts). Order by numShippedProducts descending, then first customer name ascending, and second customer name ascending. Show customer pairs that have 5 or more times that they have been shipped the same product.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 9,
            "question": "Return a complete list of all customers (cid, cname), the total number of shipments, and total shipped value (amount*price) that they have been shipped. Return the bottom five customers by total shipped value.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 10,
            "question": "Return the products that are shipped more often than the average number of times a product is shipped. Order by number of shipments descending and product id ascending.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 11,
            "question": "Return the product names, price, inventory, and inventory value of each product (`price*inventory`) (rename as `inventoryValue`) for products with price greater than `$20`. Order by product name ascending.",
            "query_string": "",
            "type": "simple"
        },
        {
            "id": 12,
            "question": "Return the customer id, name, state, and shipment date for all customers in `'BC'` or `'IA'` that have had a shipment in `2022`. Order by `shipdate` descending and `cname` ascending.",
            "query_string": "",
            "type": "medium"
        },
        {
            "id": 13,
            "question": "Find all customers that either have the word `'street'` in their street address or have no street address. ",
            "query_string": "",
            "type": "simple"
        },
        {
            "id": 14,
            "question": "Return a list of the unique city and states of customers. Order output by `state` descending.",
            "query_string": "",
            "type": "simple"
        },
        {
            "id": 15,
            "question": "For each city, return the number of customers in that city and the number of shipments for customers in that city. **Hint: COUNT(DISTINCT *field*) may be useful.** Only show cities with at least 2 shipments. Order by number of shipments descending and city ascending.",
            "query_string": "",
            "type": "medium"
        },
        {
            "id": 16,
            "question": "Return the top 5 products for state `'BC'` based on shipment revenue (`amount*price`) for the year `2021`.",
            "query_string": "",
            "type": "medium"
        },
        {
            "id": 17,
            "question": "Return a list of products (id and name) along with the number of times it has been shipped, the total amount of all shipments, and the total value of all shipments. Only consider shipments after `March 10th, 2022`, and only show products if they have been shipped at least twice. Order by `totalValueShipped` descending.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 18,
            "question": "Return pairs of products (only show a pair once) that appear together in the same shipment and have at least an `amount` of 2 in that shipment. Return the number of times the products appear together in a shipment ('numTogether'). Order by `numTogether` descending, then first product name ascending, and second product name ascending.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 19,
            "question": "Return a complete list of  products (`pid`, `pname`), the total number of shipments, and total shipped amount that they have been shipped to customers in `'IA'`.",
            "query_string": "",
            "type": "complex"
        },
        {
            "id": 20,
            "question": "Return the customers who have more shipments than the average number of shipments per customer.",
            "query_string": "",
            "type": "complex"
        }
    ]
}
